{
   "classes": {
      "Company": {
         "high-level definition": "A legal business entity engaged in commercial, industrial, or professional activities.",
         "llm-guidance": "Extract entities identified as registered businesses with suffixes like 'Sdn Bhd', 'Berhad', or 'Pte Ltd'. Use the full legal name. Do not include the registration number together with the company name, if present.",
         "examples": [
            "Oriental Kopi Holdings Berhad",
            "Paradise Group",
            "United Gomax Sdn Bhd"
         ]
      },
      "Person": {
         "high-level definition": "An individual human associated with a company.",
         "llm-guidance": "Extract full names of individuals, removing titles (e.g., 'Dato'', 'Dr.', 'Mr.') or roles (e.g., 'CEO'). For example, 'Dato' Ng Wan Peng' becomes 'Ng Wan Peng'.",
         "examples": [
            "Chan Jian Chern",
            "Goh Ting Keong",
            "Koay Song Leng"
         ]
      },
      "Place": {
         "high-level definition": "A broad geographic location, such as a city, region, or country.",
         "llm-guidance": "Extract one meaningful place name (e.g., city, region, country, or continent), and ignore street names, postal codes, or unit numbers if present. For example, from 'B2-3A01, Meritus Tower, Petaling Jaya', extract 'Petaling Jaya'. For the description of a place name, no value needs to be provided, make it an empty string.",
         "examples": [
            "Penang",
            "Texas",
            "Malaysia",
            "China",
            "South America"
         ]
      },
      "Product": {
         "high-level definition": "A tangible good created, sold, or distributed by a company.",
         "llm-guidance": "Extract only physical items produced or sold by a company, excluding services or intangible offerings. Use the specific product name if provided.",
         "examples": [
            "GPU",
            "Furniture",
            "iPhone"
         ]
      },
      "Service": {
         "high-level definition": "An intangible offering provided by a company.",
         "llm-guidance": "Extract intangible offerings, excluding physical products. Use the specific service name if provided.",
         "examples": [
            "Cafe F&B Services",
            "Marketing Service",
            "Maintenance Services"
         ]
      }
   },
   "axioms": {
      "relationships": [
         {
            "source": "Company",
            "target": "Company",
            "type": "hasSubsidiary",
            "llm-guidance": "Use this when Company A owns, controls, or is the parent of Company B.",
            "example": "Oriental Kopi Holdings Berhad hasSubsidiary OKG Sdn Bhd"
         },
         {
            "source": "Company",
            "target": "Company",
            "type": "hasSupplier",
            "llm-guidance": "Use when Company B supplies Company A with physical, tangible products, materials, components, or standalone software/hardware (e.g., semiconductors, licensed software products). If a product (e.g., 'Tesla Cybertruck') is mentioned without a company name, map it to the owning company (e.g., 'Tesla, Inc'). Exclude open-source tools without a clearly named provider.",
            "example": "NVIDIA Corporation hasSupplier SK Hynix Inc"
         },
         {
            "source": "Company",
            "target": "Company",
            "type": "hasServiceProvider",
            "llm-guidance": "Use when Company B provides Company A with professional, contractual, or managed services-such as auditing, legal, underwriting, share registration, company secretarial work, market research, or software-as-a-service (SaaS). This includes digital platforms accessed as a service.",
            "example": "Techno Solutions Sdn Bhd hasServiceProvider Deloitte Malaysia"
         },
         {
            "source": "Company",
            "target": "Company",
            "type": "hasCompetitor",
            "llm-guidance": "Use this when Company A and Company B are described as competing in the same industry, offering similar products or services, or targeting the same market. The competition must be clearly stated.",
            "example": "Coca-Cola hasCompetitor PepsiCo"
         },
         {
            "source": "Company",
            "target": "Company",
            "type": "hasBusinessPartner",
            "llm-guidance": "Use this when Company A and Company B are explicitly described as engaging in a strategic business partnership, such as joint ventures, co-developed products or services, or formal strategic alliances. The partnership must involve mutual collaboration beyond standard transactional relationships (e.g., supplier-client, buyer-seller, or service provider contracts). Do not use for professional services like auditing, underwriting, or share registration unless a deeper strategic collaboration is clearly stated.",
            "example": "Microsoft Corporation hasBusinessPartner OpenAI Inc"
         },
         {
            "source": "Company",
            "target": "Person",
            "type": "hasDirector",
            "llm-guidance": "Use this when a person is described as holding a director-level position in a company. This includes all kinds of directorships such as executive director, non-executive director, managing director, independent director, and alternate director.",
            "example": "NVIDIA Corporation hasDirector Jensen Huang"
         },
         {
            "source": "Company",
            "target": "Person",
            "type": "hasManagementTeamMember",
            "llm-guidance": "Use this when a person is identified as part of a company's management team. This includes any executive or senior management role such as CEO, CFO, COO, CTO, CMO, General Manager, Head of Department, or equivalent leadership roles.",
            "example": "OpenAI Inc hasManagementTeamMember Sam Altman"
         },
         {
            "source": "Company",
            "target": "Company",
            "type": "hasCorporateShareholder",
            "llm-guidance": "Use this when one company (Company B) is a shareholder of another company (Company A). This means Company A has Company B as its shareholder.",
            "example": "Tesla, Inc hasCorporateShareholder The Vanguard Group, Inc."
         },
         {
            "source": "Company",
            "target": "Person",
            "type": "hasIndividualShareholder",
            "llm-guidance": "Use this when a person is described as a shareholder of a company.",
            "example": "Tesla, Inc. hasIndividualShareholder Elon Musk"
         },
         {
            "source": "Company",
            "target": "Place",
            "type": "hasOperationIn",
            "llm-guidance": "Use when a company is described as having physical business presence such as offices, stores, factories, facilities, or branches in a location.",
            "example": "Oriental Kopi hasOperationIn Klang Valley"
         },
         {
            "source": "Company",
            "target": "Place",
            "type": "exportsTo",
            "llm-guidance": "Use when a company is described as exporting, selling, or distributing its tangible products to another country or international market.",
            "example": "Tesla, Inc. exportsTo China"
         },
         {
            "source": "Place",
            "target": "Place",
            "type": "isPartOf",
            "llm-guidance": "Use when one geographic place is part of a larger geographic region, such as a city within a state or a region within a country.",
            "example": "Perak isPartOf Malaysia"
         },
         {
            "source": "Company",
            "target": "Product",
            "type": "produces",
            "llm-guidance": "Use when a company produces a tangible product.",
            "example": "Oriental Kopi produces Packaged Coffee"
         },
         {
            "source": "Company",
            "target": "Service",
            "type": "offers",
            "llm-guidance": "Use when a company offers intangible services.",
            "example": "Oriental Kopi offers Cafe F&B Services"
         }
      ]
   }
}